function [Ux,Uy] = BoundaryCondition(U)
u = 686.47;
T = 293.15;
p = 99719;
R = 287.14;

Nx = size(U,1);
Ny = size(U,2);
Ux = zeros(Nx+6,Ny,4);           
Uy = zeros(Nx,Ny+6,4);

%内点
Ux(4:Nx+3,1:Ny,:) = U;
Uy(1:Nx,4:Ny+3,:) = U;

%上下两侧边界条件
Uy(Nx/4+1:Nx,[1,2,3],1) =  U(Nx/4+1:Nx,[3,2,1],1);
Uy(Nx/4+1:Nx,[1,2,3],2) =  (sqrt(3)/2)*U(Nx/4+1:Nx,[3,2,1],2)+(1/2)*U(Nx/4+1:Nx,[3,2,1],3);
Uy(Nx/4+1:Nx,[1,2,3],3) =  (1/2)*U(Nx/4+1:Nx,[3,2,1],2)-(sqrt(3)/2)*U(Nx/4+1:Nx,[3,2,1],3);
Uy(Nx/4+1:Nx,[1,2,3],4) =  U(Nx/4+1:Nx,[3,2,1],4);
Uy(1:Nx/4,[1,2,3],1) =  U(1:Nx/4,[3,2,1],1);
Uy(1:Nx/4,[1,2,3],2) =  U(1:Nx/4,[3,2,1],2);
Uy(1:Nx/4,[1,2,3],3) =  -0.5.*U(1:Nx/4,[3,2,1],3);
Uy(1:Nx/4,[1,2,3],4) =  U(1:Nx/4,[3,2,1],4);
Uy(1:Nx,[Ny+4,Ny+5,Ny+6],:) = U(1:Nx,[Ny,Ny,Ny],:);

%左右两侧边界条件
Ux([1,2,3],1:Ny,1) = p/(R*T); 
Ux([1,2,3],1:Ny,2) = p/(R*T)*u;    
Ux([1,2,3],1:Ny,3) = 0; 
Ux([1,2,3],1:Ny,4) = p/0.4 + 0.5*p/(R*T)*u^2;
Ux([Nx+4,Nx+5,Nx+6],1:Ny,:) = U([Nx,Nx,Nx],1:Ny,:);

end



